### №1 Определите, какому фильму было выставлено больше всего оценок 5.0.

In [55]:
import pandas as pd

* Без объединения, так я точно не потеряю уникальность*

In [56]:
m_df = pd.read_csv('task_1/movies.csv')
r_df = pd.read_csv('task_1/ratings.csv')
r_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [57]:
most_rated_movie = r_df[r_df['rating'] == 5.0].\
                    groupby('movieId').agg({'rating':'count'}).\
                    sort_values(by='rating', ascending = False).index[0]

In [58]:
m_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [59]:
answer = m_df[m_df['movieId'] == most_rated_movie]['title'].iloc[0]
answer

'Shawshank Redemption, The (1994)'

* с объединением *

In [60]:
merged = pd.merge(m_df,r_df, on='movieId', how='inner') # хотя how='outer' как буд-то было бы точнее?
merged.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483

In [61]:
mrm = merged[merged['rating'] ==5.0].groupby('movieId').agg({'rating':'count'}).\
                                sort_values(by='rating', ascending = False).index[0]

In [62]:
answer = merged[merged['movieId'] == mrm].title.iloc[0]
answer

'Shawshank Redemption, The (1994)'

### №2 Посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [63]:
pw_df = pd.read_csv('task_2/power.csv')
pw_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [64]:
lit, lat, est = pw_df[(pw_df['country'].str.contains('lat',case=False))|\
      (pw_df['country'].str.contains('lit',case=False))|\
     (pw_df['country'].str.contains('est',case=False))]['country'].unique()[:3]

In [74]:
lit,lat,est

('Lithuania', 'Latvia', 'Estonia')

длинный, но довольно понятный *пайплайн*

In [66]:
fltrd_df = pw_df[(pw_df['year'].between(2005,2010)) & \
          ((pw_df['category']== 4) | (pw_df['category']== 12) | (pw_df['category']== 21)) &\
          ((pw_df['country'] == lit) | (pw_df['country'] == lat) | (pw_df['country'] == est)) &\
          (pw_df['quantity'] >= 0)]

In [75]:
fltrd_df.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [67]:
pwr_quant = fltrd_df.agg({'quantity':'sum'})
pwr_quant

quantity    240580.0
dtype: float64

In [68]:
fltrd_df.quantity.sum()

240580.0

### Импортируйте таблицы в pandas DataFrame

In [69]:
URL = 'https://habr.com/ru/articles/349860/'

In [78]:
page_tbls = pd.read_html(URL, match='Один любой', encoding='utf-8')

In [71]:
page_tbls2 = pd.read_html(URL)

In [72]:
page_tbls[0].head()

,Шаблон,Описание,Пример,Применяем к тексту
0,.,"Один любой символ, кроме новой строки \n.",м.л.ко,"молоко, малако, Им0л0коИхлеб"
1,\d,Любая цифра,СУ\d\d,"СУ35, СУ111, АЛСУ14"
2,\D,"Любой символ, кроме цифры",926\D123,"926)123, 1926-1234"
3,\s,"Любой пробельный символ (пробел, табуляция, ко...",бор\sода,"бор ода, бор ода, борода"
4,\S,Любой непробельный символ,\S123,"X123, я123, !123456, 1 + 123456"